// SAOD2_Sem2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
void Swap(int &a, int &b) {
    int temp = a;
    cout << a << ' ' << b << endl;
    a = b;
    b = temp;
    cout << a << ' ' << b << endl;
}
int main()
{
    //// 1
    int x = 3;
    int *p = &x;
    cout << x << ' ' << *p << ' ' << p << &x << ' ' << endl;
    p++;
    cout << p << endl;
    cout << p - &x <<' '<< x << ' ' << *p << endl;
    //
    ////2
    typedef unsigned char byte; 	// Нет встроенного byte
    byte* pb = (byte*)--p;		// вернули указатель на x и преобразовали
    for (byte* pt = pb; pt - pb < sizeof(int); pt++)
        cout << (int)*pt << ' ';	// выводим как int
    cout << endl;

    //3
    int a = 3, b = 5;
    Swap(a, b);
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
